src/toir_cfe/src/Documents/ВнутреннееПотреблениеТоваров/ВнутреннееПотреблениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотреблениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f821681-4f9b-4186-85f8-a081e4ab09cf">
    <name>ПотреблениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a69f874-6aec-457e-8ade-4fb7762659ab">
    <name>проф_ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="048b6482-1229-4a9b-bde1-a32f6b28cf3d">
    <name>проф_ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c978a924-8a72-4669-a86a-a1e5e31fd099">
    <name>ЕстьРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="54be410d-2466-478e-8cf5-434ec98e19f1">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1b8217a5-5b59-453d-b479-c9c962e72312">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="39aa0f15-c415-409c-a64b-12fd0ee1e845">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/InformationRegisters/торо_ИнтеграцияДокументов/торо_ИнтеграцияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="17a02a98-8e64-4576-9b3b-4cfc58e2d8cf">
  <name>торо_ИнтеграцияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="e9a88077-61c6-452d-90f2-47d4f24e77da">
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="4736aca1-8591-4fd1-81ac-2e197db4fc05">
    <name>ДокументТОИР</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e9f3faae-f405-4f24-9277-030e531fcfbb">
    <name>ДокументЕРП</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/AccumulationRegisters/ЗаказыНаВнутреннееПотребление/ЗаказыНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8e3cf62-a29a-4eb6-a0cd-e005b9df98cc">
  <name>ЗаказыНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="3b3e1e2b-83d4-4335-a03f-8801607a9128">
    <name>КОформлению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="c4f0e75b-3aa7-4acb-9b3b-e7fc3b1c66e2">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="92ba211b-e615-40a8-aaf1-faae851399f1">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="581e19d8-10ab-490b-8ae2-4316b7e81b6c">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="897933ed-4417-494e-a54b-4e8adf9b7794">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0281d76f-6aa0-4fff-ab25-5a81258abfb3">
  <name>ЗаказНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="41f4f6c1-a9c4-443f-97b5-62a83d5a9725">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="feae67ed-6dc9-49c5-a307-3811be01be0e">
    <name>проф_ЗаказДляЗакупки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3130c2d1-275a-4006-8bec-ffc8eadaf912">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aaee8848-18c0-4459-8461-a6f8cde70246">
    <name>торо_СозданПоПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="873a5588-15b7-419a-ac32-2cfcdd64f86d">
    <name>проф_ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c7396b0-71b0-4c54-b9bf-4c429c4af1f6">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a9600285-8615-4521-86d8-2bca0bfd8ec8">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3a3c3667-121d-46f4-9b5f-3490c0bc2096">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff47e900-26d4-480f-862d-e7a594cde170">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd34090-ac80-44d9-b29a-f37fc28b0c69">
    <name>торо_СтатусУтверждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0c65fe73-4b60-4819-b7d6-6271b93f49c0">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f24b0b4d-40fc-46e5-9a5c-1c14fd1080ca">
    <name>проф_ТоварыИсточника</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="09a12ed1-441d-49a8-9f36-2093735e8d37">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ad62bbb-21aa-4934-a430-a1bd6aa95383">
    <name>ИспользованиеХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/toir_cfe/src/Documents/ВнутреннееПотреблениеТоваров/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

#Область Заполнение

&ИзменениеИКонтроль("ПолучитьРезультатЗапросаПоОстаткамЗаказов")
Функция проф_ПолучитьРезультатЗапросаПоОстаткамЗаказов(ДанныеОтбора, Дата, МассивЗаказов)

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Регистратор",           ДанныеОтбора.Ссылка);
	Запрос.УстановитьПараметр("Организация",           ДанныеОтбора.Организация);
	Запрос.УстановитьПараметр("Подразделение",         ДанныеОтбора.Подразделение);
	Запрос.УстановитьПараметр("Склад",                 ДанныеОтбора.Склад);
	Запрос.УстановитьПараметр("МассивЗаказов",         МассивЗаказов);
	Запрос.УстановитьПараметр("ОтобратьПоЗаказу",      МассивЗаказов <> Неопределено);

	Если Дата <> Неопределено И Дата <> '00010101' Тогда

		Запрос.УстановитьПараметр("Период", КонецДня(Дата));
		Запрос.УстановитьПараметр("ГраницаПериод", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));

	Иначе

		Запрос.УстановитьПараметр("Период", '00010101');
		Запрос.УстановитьПараметр("ГраницаПериод", Неопределено);

	КонецЕсли;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ИнтеграцияДокументов.ID КАК ID
	|ПОМЕСТИТЬ ВТ_РемонтыПоЗаявкам
	|ИЗ
	|	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
	|ГДЕ
	|	торо_ИнтеграцияДокументов.ДокументЕРП В(&МассивЗаказов)
	|	И торо_ИнтеграцияДокументов.ДокументЕРП.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(торо_ИнтеграцияДокументов.ДокументЕРП КАК Документ.ВнутреннееПотреблениеТоваров) КАК ДокументЕРП
	|ПОМЕСТИТЬ ВТ_СвязанныеПоРемонтуДокументы
	|ИЗ
	|	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
	|ГДЕ
	|	торо_ИнтеграцияДокументов.ID В
	|			(ВЫБРАТЬ
	|				ВТ_РемонтыПоЗаявкам.ID КАК ID
	|			ИЗ
	|				ВТ_РемонтыПоЗаявкам КАК ВТ_РемонтыПоЗаявкам)
	|	И торо_ИнтеграцияДокументов.ДокументЕРП ССЫЛКА Документ.ВнутреннееПотреблениеТоваров
	|	И торо_ИнтеграцияДокументов.ДокументЕРП.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаВнутреннееПотребление.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВТЗаказыОтбор
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтобратьПоЗаказу
	|				ТОГДА ЗаказНаВнутреннееПотребление.Ссылка В (&МассивЗаказов)
	|			ИНАЧЕ ЗаказНаВнутреннееПотребление.Подразделение = &Подразделение
	|					И ЗаказНаВнутреннееПотребление.Организация = &Организация
	|		КОНЕЦ
	|	И ЗаказНаВнутреннееПотребление.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &Склад)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК ЗаказНаВнутреннееПотребление,
	|	МАКСИМУМ(Товары.НомерСтроки) КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.КодСтроки КАК КодСтроки,
	|	МАКСИМУМ(Товары.Упаковка) КАК Упаковка,
	#Вставка
	//++ Проф-ИТ, #183, Соловьев А.А., 03.10.2023
	|	Товары.проф_КатегорииЭксплуатации КАК проф_КатегорииЭксплуатации,
	|	Товары.проф_ФизическоеЛицо КАК проф_ФизическоеЛицо,
	//-- Проф-ИТ, #183, Соловьев А.А., 03.10.2023
	#КонецВставки
	|	Товары.Серия КАК Серия
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.Заказ
	|			ИЗ
	|				ВТЗаказыОтбор КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.КодСтроки,
	#Вставка
	//++ Проф-ИТ, #183, Соловьев А.А., 03.10.2023
	|	Товары.проф_КатегорииЭксплуатации,
	|	Товары.проф_ФизическоеЛицо,
	//-- Проф-ИТ, #183, Соловьев А.А., 03.10.2023
	#КонецВставки
	|	Товары.Серия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодСтроки,
	|	Номенклатура,
	|	Характеристика,
	|	ЗаказНаВнутреннееПотребление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказы.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|	ТаблицаЗаказы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказы.Характеристика КАК Характеристика,
	|	ТаблицаЗаказы.КодСтроки КАК КодСтроки,
	|	СУММА(ТаблицаЗаказы.КОформлению) КАК Количество,
	|	ТаблицаЗаказы.Серия КАК Серия
	|ПОМЕСТИТЬ ТаблицаОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыОстатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыОстатки.Характеристика КАК Характеристика,
	|		ЗаказыОстатки.КодСтроки КАК КодСтроки,
	|		ЗаказыОстатки.КОформлениюОстаток КАК КОформлению,
	|		ЗаказыОстатки.Серия КАК Серия
	|	ИЗ
	|		РегистрНакопления.ЗаказыНаВнутреннееПотребление.Остатки(
	|				&ГраницаПериод,
	|				ЗаказНаВнутреннееПотребление В
	|					(ВЫБРАТЬ
	|						Т.Заказ
	|					ИЗ
	|						ВТЗаказыОтбор КАК Т)) КАК ЗаказыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказыДвижения.ЗаказНаВнутреннееПотребление,
	|		ЗаказыДвижения.Номенклатура,
	|		ЗаказыДвижения.Характеристика,
	|		ЗаказыДвижения.КодСтроки,
	|		ВЫБОР
	|			КОГДА ЗаказыДвижения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЗаказыДвижения.КОформлению
	|			ИНАЧЕ ЗаказыДвижения.КОформлению
	|		КОНЕЦ,
	|		ЗаказыДвижения.Серия
	|	ИЗ
	|		РегистрНакопления.ЗаказыНаВнутреннееПотребление КАК ЗаказыДвижения
	|	ГДЕ
	|		ЗаказыДвижения.Регистратор = &Регистратор
	|		И ЗаказыДвижения.ЗаказНаВнутреннееПотребление В
	|				(ВЫБРАТЬ
	|					Т.Заказ
	|				ИЗ
	|					ВТЗаказыОтбор КАК Т)
	|		И ЗаказыДвижения.Активность
	|		И ВЫБОР
	|				КОГДА &Период <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ЗаказыДвижения.Период <= &Период
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК ТаблицаЗаказы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаказы.Номенклатура,
	|	ТаблицаЗаказы.Характеристика,
	|	ТаблицаЗаказы.КодСтроки,
	|	ТаблицаЗаказы.ЗаказНаВнутреннееПотребление,
	|	ТаблицаЗаказы.Серия
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаЗаказы.КОформлению) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодСтроки,
	|	Номенклатура,
	|	Характеристика,
	|	ЗаказНаВнутреннееПотребление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВнутреннееПотреблениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ВнутреннееПотреблениеТоваровТовары.Характеристика КАК Характеристика,
	|	ВнутреннееПотреблениеТоваровТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВнутреннееПотреблениеТоваровТовары.Количество КАК Количество,
	|	ВнутреннееПотреблениеТоваровТовары.КодСтроки КАК КодСтроки,
	|	ВнутреннееПотреблениеТоваровТовары.Серия КАК Серия
	|ПОМЕСТИТЬ ВТ_ЗаказанныеПоСвязанномуРемонту
	|ИЗ
	|	Документ.ВнутреннееПотреблениеТоваров.Товары КАК ВнутреннееПотреблениеТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязанныеПоРемонтуДокументы КАК ВТ_СвязанныеПоРемонтуДокументы
	|		ПО ВнутреннееПотреблениеТоваровТовары.Ссылка = ВТ_СвязанныеПоРемонтуДокументы.ДокументЕРП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОстатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|	ТаблицаОстатки.Номенклатура КАК Номенклатура,
	|	ТаблицаОстатки.Характеристика КАК Характеристика,
	|	ТаблицаОстатки.КодСтроки КАК КодСтроки,
	|	ТаблицаОстатки.Количество - ЕСТЬNULL(ВТ_ЗаказанныеПоСвязанномуРемонту.Количество, 0) КАК Количество,
	|	ТаблицаТовары.Упаковка КАК Упаковка,
	|	ТаблицаТовары.Упаковка.Коэффициент КАК Коэффициент,
	#Вставка
	//++ Проф-ИТ, #27, Соловьев А.А., 28.08.2023
	|	ТаблицаТовары.проф_КатегорииЭксплуатации КАК проф_КатегорииЭксплуатации,
	|	ТаблицаТовары.проф_ФизическоеЛицо КАК проф_ФизическоеЛицо,
	|	ДокументЗаказНаВнутреннееПотребление.проф_Назначение КАК проф_Назначение,
	//-- Проф-ИТ, #27, Соловьев А.А., 28.08.2023
	#КонецВставки
	|	ТаблицаОстатки.Серия КАК Серия
	|ИЗ
	|	ТаблицаОстатки КАК ТаблицаОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТовары
	|		ПО ТаблицаОстатки.Номенклатура = ТаблицаТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = ТаблицаТовары.Характеристика
	|			И ТаблицаОстатки.КодСтроки = ТаблицаТовары.КодСтроки
	|			И ТаблицаОстатки.ЗаказНаВнутреннееПотребление = ТаблицаТовары.ЗаказНаВнутреннееПотребление
	|			И ТаблицаОстатки.Серия = ТаблицаТовары.Серия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказанныеПоСвязанномуРемонту КАК ВТ_ЗаказанныеПоСвязанномуРемонту
	|		ПО ТаблицаОстатки.Номенклатура = ВТ_ЗаказанныеПоСвязанномуРемонту.Номенклатура
	|			И ТаблицаОстатки.Характеристика = ВТ_ЗаказанныеПоСвязанномуРемонту.Характеристика
	|			И ТаблицаОстатки.Серия = ВТ_ЗаказанныеПоСвязанномуРемонту.Серия
	#Вставка
	//++ Проф-ИТ, #27, Соловьев А.А., 28.08.2023
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление КАК ДокументЗаказНаВнутреннееПотребление
	|		ПО ТаблицаОстатки.ЗаказНаВнутреннееПотребление = ДокументЗаказНаВнутреннееПотребление.Ссылка
	//-- Проф-ИТ, #27, Соловьев А.А., 28.08.2023
	#КонецВставки
	|ГДЕ
	|	ТаблицаОстатки.Количество - ЕСТЬNULL(ВТ_ЗаказанныеПоСвязанномуРемонту.Количество, 0) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаОстатки.ЗаказНаВнутреннееПотребление.Дата,
	|	ТаблицаОстатки.ЗаказНаВнутреннееПотребление,
	|	ТаблицаТовары.НомерСтроки";

	УстановитьПривилегированныйРежим(Истина);

	Возврат Запрос.Выполнить();

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

//++ Проф-ИТ, #132, Горетовская М.С., 21.09.2023 - ПФ и отчеты: Акт о списании расходных материалов, использованных для ТОиР
&После("ДобавитьКомандыПечати")
Процедура проф_ДобавитьКомандыПечати(КомандыПечати)
	
	//проф_АктОСписанииРасходныхМатериалов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "проф_АктОСписанииРасходныхМатериалов";
	КомандаПечати.Представление = НСтр("ru = 'Акт о списании расходных материалов, использованных для ТОиР'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

	//++ Проф-ИТ, #366, Соловьев А.А., 22.11.2023
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "М11";
	КомандаПечати.Представление = НСтр("ru = 'Требование-накладная (М-11)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//-- Проф-ИТ, #366, Соловьев А.А., 22.11.2023
	
КонецПроцедуры

&После("Печать")
Процедура проф_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "проф_АктОСписанииРасходныхМатериалов") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"проф_АктОСписанииРасходныхМатериалов",
			НСтр("ru = 'Акт о списании расходных материалов, использованных для ТОиР'"),
			проф_ПечатьАктОСписанииРасходныхМатериалов(МассивОбъектов, ПараметрыПечати));
	КонецЕсли;
	
	//++ Проф-ИТ, #366, Соловьев А.А., 22.11.2023
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М11") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"М11",
			НСтр("ru = 'Требование-накладная (М-11)'"),
			проф_ПечатьМ11(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	//-- Проф-ИТ, #366, Соловьев А.А., 22.11.2023
	
КонецПроцедуры

Функция проф_ПечатьАктОСписанииРасходныхМатериалов(МассивОбъектов, ПараметрыПечати)

	ОбработкаПечати = Обработки.проф_АктОСписанииРасходныхМатериаловДляТОиР.Создать();
	Возврат ОбработкаПечати.ПечатьАктОСписании(МассивОбъектов, ПараметрыПечати);

КонецФункции
//-- Проф-ИТ, #132, Горетовская М.С., 21.09.2023 - ПФ и отчеты: Акт о списании расходных материалов, использованных для ТОиР

//++ Проф-ИТ, #366, Соловьев А.А., 22.11.2023
Функция проф_ПечатьМ11(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнутреннееПотреблениеТоваров.Ссылка КАК Ссылка,
	|	ВнутреннееПотреблениеТоваров.Номер КАК НомерДокумента,
	|	ВнутреннееПотреблениеТоваров.Дата КАК ДатаДокумента,
	|	СправочникОрганизации.Представление КАК Организация,
	|	Склады.Представление КАК Склад,
	|	ВнутреннееПотреблениеТоваров.Подразделение КАК Подразделение,
	|	Склады.ТекущийОтветственный.Представление КАК Ответственный,
	|	Склады.ТекущаяДолжностьОтветственного.Представление КАК ДолжностьОтветственного,
	|	СправочникОрганизации.торо_НаименованиеСокращенное КАК Наименование,
	|	СправочникОрганизации.КодПоОКПО КАК КодОКПО,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникОрганизации.ИНН, """") = """"
	|			ТОГДА """"
	|		ИНАЧЕ "", ИНН "" + ЕСТЬNULL(СправочникОрганизации.ИНН, """")
	|	КОНЕЦ КАК ИНН,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(АдресОрганизации.Представление, """") = """"
	|			ТОГДА """"
	|		ИНАЧЕ "", "" + АдресОрганизации.Представление
	|	КОНЕЦ КАК ЮридическийАдрес
	|ИЗ
	|	Документ.ВнутреннееПотреблениеТоваров КАК ВнутреннееПотреблениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|		ПО ВнутреннееПотреблениеТоваров.Склад = Склады.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК СправочникОрганизации
	|		ПО ВнутреннееПотреблениеТоваров.Организация = СправочникОрганизации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК АдресОрганизации
	|		ПО ВнутреннееПотреблениеТоваров.Организация = АдресОрганизации.Ссылка
	|			И (АдресОрганизации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (АдресОрганизации.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	|ГДЕ
	|	ВнутреннееПотреблениеТоваров.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВнутреннееПотреблениеТоваровТовары.Ссылка КАК Ссылка,
	|	СправочникНоменклатура.НаименованиеПолное КАК Номенклатура,
	|	СправочникНоменклатура.Артикул КАК Артикул,
	|	СУММА(ВнутреннееПотреблениеТоваровТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ВнутреннееПотреблениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА СправочникНоменклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ЕдиницыИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ВЫБОР
	|		КОГДА ВнутреннееПотреблениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА СправочникНоменклатура.ЕдиницаИзмерения.Наименование
	|		ИНАЧЕ ЕдиницыИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование
	|ИЗ
	|	Документ.ВнутреннееПотреблениеТоваров.Товары КАК ВнутреннееПотреблениеТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ВнутреннееПотреблениеТоваровТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО УпаковкиНоменклатуры.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ПО ВнутреннееПотреблениеТоваровТовары.Упаковка = УпаковкиНоменклатуры.Ссылка
	|ГДЕ
	|	ВнутреннееПотреблениеТоваровТовары.Ссылка В(&МассивСсылок)
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Артикул,
	|	ВЫБОР
	|		КОГДА ВнутреннееПотреблениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА СправочникНоменклатура.ЕдиницаИзмерения.Наименование
	|		ИНАЧЕ ЕдиницыИзмерения.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВнутреннееПотреблениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА СправочникНоменклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ЕдиницыИзмерения.Код
	|	КОНЕЦ,
	|	ВнутреннееПотреблениеТоваровТовары.Ссылка,
	|	СправочникНоменклатура.НаименованиеПолное";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_М11";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаПоДокументам = МассивРезультатов[0].Выбрать();
	ВыборкаТовары 		= МассивРезультатов[1].Выбрать();
	
	МакетПечати = ПолучитьМакет("ПФ_MXL_М11");
	
	ОбластьШапка 		= МакетПечати.ПолучитьОбласть("Шапка");
	ОбластьЗаголовок	= МакетПечати.ПолучитьОбласть("Заголовок");
	ОбластьСтрока		= МакетПечати.ПолучитьОбласть("Строка");
	ОбластьПодвал		= МакетПечати.ПолучитьОбласть("Подвал");
	
	ПервыйДокумент = Истина;
	Пока ВыборкаПоДокументам.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		ПредставлениеОрганизации = ВыборкаПоДокументам.Организация + ВыборкаПоДокументам.ИНН + ВыборкаПоДокументам.ЮридическийАдрес;
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаПоДокументам);
		ОбластьШапка.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаПоДокументам.НомерДокумента, Истина, Истина);
		ОбластьШапка.Параметры.ДатаСоставления = Формат(ВыборкаПоДокументам.ДатаДокумента, "ДЛФ=Д");
		ОбластьШапка.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации;
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ВысотаТаблицы = ТабличныйДокумент.ВысотаТаблицы + 2;
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Пока ВыборкаТовары.НайтиСледующий(Новый Структура("Ссылка", ВыборкаПоДокументам.Ссылка)) Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаТовары);
			Если ТабличныйДокумент.ПроверитьВывод(ОбластьПодвал) Тогда
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			Иначе
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			КонецЕсли;
			
		КонецЦикла;
		
		ВыборкаТовары.Сбросить();
		
		ОбластьПодвал.Параметры.Заполнить(ВыборкаПоДокументам);
		
		Если ТабличныйДокумент.ПроверитьВывод(ОбластьПодвал) Тогда
			ТабличныйДокумент.Вывести(ОбластьПодвал);
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент.Вывести(ОбластьПодвал);
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;

	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
//-- Проф-ИТ, #366, Соловьев А.А., 22.11.2023

#КонецОбласти

#КонецОбласти
